---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.AlignedFreeFormSetOrientationOptions.Vertical
enum: Autodesk.Revit.DB.Structure.AlignedFreeFormSetOrientationOptions
source: html/3f3bd792-6e89-1417-e11f-cd013a30b614.htm
---
# Autodesk.Revit.DB.Structure.AlignedFreeFormSetOrientationOptions.Vertical

Cutting planes are oriented vertically, X or Y vector being Z axis.